#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃更新機能：移動
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import 処理.DB

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
		#┬
        #●└┐リスト型オブジェクトを更新する
        self.Fn移動((
                処理.DB.obj背景       ,
                処理.DB.obj特殊効果   ,
                処理.DB.obj自機       ,
                処理.DB.obj敵機       ,
                処理.DB.objアイテム   ,
                処理.DB.obj弾_自機    ,
                処理.DB.obj弾_敵機    ,
                処理.DB.obj爆発       ,
                処理.DB.FNシーン[ 処理.DB.シーン ]))
		#┴ 
	#────────────────────────────────────	
    def Fn移動(self, 引数_処理リスト):
		#┬
		#◎└┐すべてのオブジェクトを描画する
        for tmp処理 in 引数_処理リスト:
			#│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #◇┐要素オブジェクトを描画する
            if isinstance(tmp処理, list):
            #　├┐（リストオブジェクトの場合）
                #↓
                #◎└┐要素オブジェクトを描画する
                for tmp要素 in tmp処理:
                    #│＼（すべての処理を終えた場合）
                    #│ ↓
                    #│ ▼繰り返し処理を抜ける
                    #│
                    #●オブジェクトを描画する
                    tmp要素.FN移動.実行()
                    #┴ 

            elif tmp処理 is not None:
            #　├┐（折返しタイミングの場合）
                #↓
                #●オブジェクトを描画する
                tmp処理.FN移動.実行()
            #　└┐（その他）
        #┴　┴　┴
