#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃技術評論社 ゲームで学ぶPython！ CHAPTER6:MAGA WING
#┠─────────────────────────────────────
#┃処理（キャラクタの更新：画面座標を移動）
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃Ⅰ.インポート
#┠───┬─────────────────────────────────
#┃概　要│※使用なし
#┗━━━┷━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃Ⅱ．クラス
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class class移動処理:

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃０．初期化処理 
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def __init__(self,
            引数_生成先):   #① 生成先のオブジェクト
		#┬
        #□生成先のオブジェクト
        self.GAME = 引数_生成先
        #┴　┴

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃１．更新処理
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
		#┬
        #●自機を更新する
        self.Fn自機()
        #│
        #●└┐リスト型オブジェクトを更新する
        self.Fnリスト(self.GAME.obj標的     )
        self.Fnリスト(self.GAME.obj弾_自機  )
        self.Fnリスト(self.GAME.obj弾_標的  )
        self.Fnリスト(self.GAME.obj爆発     )
		#┴  ┴
	#────────────────────────────────────	
    def Fn自機(self):
		#┬
        #○自機の状態を確認する
        if self.GAME.obj自機 is None: return
        #│＼（存在しない場合）
        #│ ↓
        #│ ▼繰処理を中断する
        #│
        #●自機を更新する
        self.GAME.obj自機.移動処理()
        #┴
	#────────────────────────────────────	
    def Fnリスト(self,
            arg対象):     #① 弾(自機)オブジェクト
		#┬
		#◎└┐すべての標的を更新する
        for tmpObj in arg対象:
			#│＼（すべての処理を終えた場合）
            #│ ↓
			#│ ▼繰り返し処理を抜ける
			#│
            #●ひとつずつ更新する            
            tmpObj.移動処理()
		#┴  ┴
