#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：プレイ画面(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel # フレームカウントの参照、ランダム関数で利用
import main.DB
from   ..DB import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #------------------------------------------------------------------------
    # カウンタ
    #------------------------------------------------------------------------
    #□持続時間   ：ボス警告を持続する長さ（単位：fps）
    持続時間        = 150

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    #------------------------------------------------------------------------
    # カウンタ
    #------------------------------------------------------------------------
    #□開始時間  ：ボス警告を持続するカウンタ
    開始時間    = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様 = 仕様クラス()
        self.情報 = 情報クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #◇┐状況に応じて進行する 
        if main.DB.obj自機共通.情報.シールド <= 0:
        #　├┐（シールドが切れた場合）
            #↓
            #●次のシーン『終了画面』に進行する
            self.Fn次シーン準備()
            #┴   

        elif main.DB.情報.ボスシーン != None:
        #　├┐（ボス襲来で警告中の場合）
            #↓
            #●ボスの登場を処理する
            self.Fnボス処理()
            #┴            

        elif main.DB.情報.プレイ時間 % main.仕様.ゲーム.難易度間隔 == 0:
        #　├┐（レベルの変わり目の場合）
            #↓
            #○ボスシーンを『ボス警告』に進行する
            #○ボス警告カウントを開始する
            #○プレイ時間を1つ進める ※ボスシーンを繰り返さない為
            main.DB.情報.ボスシーン = シーンID.ボス警告
            self.情報.開始時間 = pyxel.frame_count
            main.DB.情報.プレイ時間 += 1
            #┴            

        else:
        #　└┐（その他）
            #↓
            #○プレイ時間を１つ進める
            #○難易度をセットする
            main.DB.情報.プレイ時間 += 1
            main.DB.情報.難易度 = main.DB.情報.プレイ時間 // main.DB.仕様.ゲーム.難易度間隔 + 1
        #┴　┴

    #┌───────────────────────────────────
    #│ボス登場を確認する
    #└───────────────────────────────────
    def Fnボス処理(self):
        #┬
        #○ボスシーンを確認する
        if main.DB.情報.ボスシーン == None: return
        #│＼（僕警告ではない場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #◇┐ボスシーンを進行する
        if main.DB.情報.ボスシーン == シーンID.ボス警告:
        #　├┐（ボス警告の場合）
            #↓
            #○警告時間を減らす
            経過時間 = pyxel.frame_count - self.情報.開始時間
            時間あり = (経過時間 < self.仕様.持続時間)
            if 時間あり: return
            #│＼（まだ時間がある場合）
            #│ ↓
            #│ ▼処理を中断する
            #│
            #○ボスシーンを『ボス登場』に進行する
            main.DB.情報.ボスシーン = シーンID.ボス登場
            #│
            #●敵機・アイテムを消滅する
            main.DB.爆発.壊滅(main.DB.obj敵機    )
            main.DB.爆発.壊滅(main.DB.objアイテム)
            #│
            #●特殊効果を解除(永続は残す)
            #〇シールドを満タンにする
            #〇弾を満タンにする
            main.DB.obj特殊効果.FN移動.強制解除()
            main.DB.obj自機共通.情報.シールド = main.仕様.環境.画面幅
            main.DB.obj自機共通.情報.弾数 = main.DB.obj自機共通.仕様.積載量
            #┴
        elif main.DB.情報.ボスシーン == シーンID.ボス対決:
        #　├┐（ボス対決の場合）
            #↓
            #◇┐ボスシーン(ボス登場)を進行する
            if len(main.DB.obj敵機) == 0:
            #　├┐（ボスが全滅した場合）
                #↓
                #〇ボスシーンを終了する
                main.DB.情報.ボスシーン = None
                #│
                #〇シールドを満タンにする
                #〇弾を満タンにする
                main.DB.obj自機共通.情報.シールド = main.仕様.環境.画面幅
                main.DB.obj自機共通.情報.弾数 = main.DB.obj自機共通.仕様.積載量
            #　└┐（その他）
            #┴　┴

    #┌───────────────────────────────────
    #│次シーンの前準備
    #└───────────────────────────────────
    def Fn次シーン準備(self):
        #┬
        #○シーンを『終了画面』に進行する
        main.DB.情報.シーン = シーンID.終了画面
        #│
        #◎└┐自機をすべて爆破する
        for tmp自機 in main.DB.obj自機:
            #│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #●大爆発する
            d = main.DB.obj自機共通.仕様.爆発オフセット
            x = tmp自機.情報.X + d
            y = tmp自機.情報.Y
            main.DB.爆発.大爆発(x, y, 4, 6)
        #│
        #○自機を消滅する ※弾が残る場合を考慮し、特殊効果・自機共通は残す
        main.DB.obj自機 = []
        #│
        #●爆発音を鳴らす
        main.DB.効果音.爆発(2)
        #┴